IDEA StatiCa Open Model
Member2D.Members1D Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Array of internal members, ribs
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> Members1D { get; set; }
Public Property Members1D As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ Members1D {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
Member2D Class
IdeaRS.OpenModel.Model Namespace